examples/dfLowMachFoam/paddle/oneD_freelyPropagation/C2H4/constant/CanteraTorchProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version          2.0;
    format           ascii;
    class            dictionary;
    location         "constant";
    object           CanteraTorchProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistry            on;

CanteraMechanismFile "Wu24sp.yaml";

transportModel       "Mix";

odeCoeffs
{
    "relTol"         1e-6;
    "absTol"         1e-10;
}

inertSpecie          "N2";

splittingStrategy    off;

TorchSettings
{
    torch             on;
    GPU               on;
    log               on;
    torchModel        "DNN_model.pt"; 
    frozenTemperature 510;
    inferenceDeltaTime 1e-7;
    coresPerNode      4;
}

loadbalancing
{
    active           true;
    log              false;
    algorithm        allAverage;//headTail;
}


// ************************************************************************* //
